{
  "backend/main.mo": "Motoko actor that manages learning module progress using a Map, exposing functions to mark modules complete, check completion status, retrieve all progress, and reset individual modules.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (3D hero, module cards, SMT/ICT/Price Action/Indicators pages) to their source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON summaries describing the PriceActionModule and IndicatorsModule pages, noting their candlestick pattern coverage, chart visualizations, and Mark as Complete buttons.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom properties for light and dark themes including background, foreground, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the TraderLearn 3D app, mounting the React app into a root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Home, SMT, ICT, Price Action, and Indicators pages, all wrapped in a layout with a Navbar.",
  "frontend/src/components/AnimatedCandlestickChart.tsx": "Canvas-based animated candlestick chart component that progressively reveals candles, supports highlight effects, wick/body rendering, and optional pattern labels.",
  "frontend/src/components/CompleteButton.tsx": "Button component that calls the backend to mark a module complete, showing loading, completed, and congratulations states using React Query mutations and queries.",
  "frontend/src/components/ConceptDiagram.tsx": "Canvas-based diagram component that renders annotated educational illustrations for trading concepts including SMT divergence, order blocks, fair value gaps, market structure, and support/resistance.",
  "frontend/src/components/Hero3D.tsx": "A Three.js-based 3D hero section component featuring animated floating particles, candlestick charts, a scrolling grid floor, and a glowing torus ring rendered via React Three Fiber.",
  "frontend/src/components/IndicatorChart.tsx": "A Canvas-based chart component that renders static visualizations for various technical indicators (MA, RSI, MACD, Bollinger Bands, Volume) based on the passed indicator type prop.",
  "frontend/src/components/ModuleCard3D.tsx": "A 3D-tilt interactive card component for displaying a trading module with mouse-tracking perspective effects, hover shimmer, completion badge, and navigation on click.",
  "frontend/src/components/ModuleCarousel.tsx": "A grid layout section that renders all four trading module cards (SMT, ICT, Price Action, Indicators) with completion status fetched from a query hook and a progress summary indicator.",
  "frontend/src/components/Navbar.tsx": "A fixed top navigation bar with links to all module pages, active route highlighting, and a responsive mobile hamburger menu.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an Internet Computer actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating module progress data via a canister actor, including getting all progress, checking completion, and marking modules complete.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind, and defines a dark trading-themed design system with custom CSS variables, utility classes, and animations.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Home.tsx": "Home page component featuring a 3D hero section, stats bar, and module carousel for a trading education platform.",
  "frontend/src/pages/ICTModule.tsx": "Learning module page covering ICT (Inner Circle Trader) methodology concepts such as Order Blocks, with concept cards, diagrams, and a completion button.",
  "frontend/src/pages/IndicatorsModule.tsx": "Learning module page for technical indicators (MA, RSI, MACD, Bollinger Bands, Volume) with interactive charts, how-to-read guides, and practical trading tips.",
  "frontend/src/pages/PriceActionModule.tsx": "A React page component for the Price Action learning module that displays educational sections on candlestick patterns (Pin Bar, Engulfing, Doji, etc.) with animated charts, concept diagrams, and a complete button.",
  "frontend/src/pages/SMTModule.tsx": "A React page component for the SMT (Smart Money Technique) learning module that covers definition, core principles, and visual diagrams with concept cards and a complete button.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom fonts (Orbitron, Space Grotesk), a dark-themed color palette with gold and trade-green/red tokens, custom shadows, and keyframe animations for the trading education app.",
  "project_state.json": "Project state metadata file tracking the current version, architectural notes, existing features, and image requirements for the TraderVerse Academy educational trading website."
}